InformationRegisters/РегистрСостоянийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РегистрСостоянийОбъектов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СостояниеОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСогласования</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектыДляСогласования</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИИТ_УведомленияОВозвратеСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ИИТ_УведомленияОВозвратеСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пояснение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СостоянияСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РегистрСостоянийОбъектов/Ext/RecordSetModule.bsl
&После("ПриЗаписи")
Процедура АЛФ_ПриЗаписи(Отказ, Замещение)

	//+ИИТ_Аксеньюшкин
	Для Каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если ТипЗнч(СтрокаНабора.Объект) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") 
		И СтрокаНабора.СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена 
		И ЗначениеЗаполнено(СтрокаНабора.Объект.ИИТ_ПроектСогласования)
		И ЗначениеЗаполнено(СтрокаНабора.Объект.ИИТ_ПроектСогласования.ИИТ_ПользовательДляУведомления)
		И Прав(СокрЛП(СтрокаНабора.Объект.Номер), 1) <> "П" И НЕ СтрокаНабора.Объект.ИИТ_ОтразитьБДДС Тогда

			НоваяЗапись = РегистрыСведений.ИИТ_УведомленияОВозвратеСогласования.СоздатьМенеджерЗаписи();
			НоваяЗапись.Заявка = СтрокаНабора.Объект;
			НоваяЗапись.Ответственный = СтрокаНабора.Объект.ИИТ_ПроектСогласования.ИИТ_ПользовательДляУведомления;
			НоваяЗапись.ДатаСоздания = ТекущаяДата();
			НоваяЗапись.Пояснение = "Оплачена заявка";
			НоваяЗапись.Записать(Истина);

		КонецЕсли;
		
		Если ТипЗнч(СтрокаНабора.Объект) = Тип("ДокументСсылка.АвансовыйОтчет") 
		И СтрокаНабора.СостояниеОбъекта = Перечисления.СостоянияСогласования.Утверждена Тогда
			ДокОбъект = СтрокаНабора.Объект.ПолучитьОбъект();
			ДокОбъект.ИИТ_РасходСогласован = Истина;
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

	КонецЦикла;
	//-ИИТ_Аксеньюшкин

КонецПроцедуры
